Revit 2027 API
DistributionSysType Properties
The DistributionSysType type exposes the following members.
Properties
Name | Description
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
CanBeCopied |  Determine if this ElementType can create a copy
(Inherited from ElementType)
CanBeDeleted |  Determine if this ElementType can be deleted
(Inherited from ElementType)
CanBeRenamed |  Determine if this ElementType can be renamed
(Inherited from ElementType)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
ElectricalPhase |  Get or set electrical phase (single, triple or undefined) of distribution system.
ElectricalPhaseConfiguration |  Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
FamilyName |  Gets the family name of this element type.
(Inherited from ElementType)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HighLegPhase |  The high-leg phase in the 3 phase 4 wires delta distribution system.
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsInUse |  Get the value which indicates whether this distribution system is in service now.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | Set the name for the ElementType.
(Inherited from ElementType)
NumWires |  Get or set number of wires of distribution system.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
VoltageLineToGround |  Get or set line to ground voltage of distribution system type.
VoltageLineToLine |  Get or set line to line voltage type of distribution system type.
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace